 virsh console head

2025-05-14: virsh to create debian VM from install iso
2025-05-21: should've considered https://cloud.debian.org/images/cloud/'s [[https://cloud.debian.org/images/cloud/bookworm-backports/20250428-2096/debian-12-backports-genericcloud-amd64-20250428-2096.qcow2][debian-12-backports-genericcloud-amd64-20250428-2096.qcow2]] as a base VM.


https://askubuntu.com/questions/576437/virsh-ssh-into-a-guest-vm
virsh net-update default add ip-dhcp-host \
    "<host mac='52:54:00:11:22:33' name='buildserver' ip='192.168.122.123'/>" \
    --config

https://warewulf.org/docs/main/getting-started/debian-quickstart.html

connect: virsh console head

* current config
** Network
on =cerebro2=
#+begin_src bash :dir /ssh:mrrc-yycerebro2:
ip addr |grep -Po '(?<=inet )[0-9.]+'
#+end_src

#+RESULTS:
|      127.0.0.1 |
| 10.141.255.253 |
| 10.148.255.250 |
|   10.48.88.160 |
|  192.168.122.1 |

node01: 10.141.0.1

#+begin_src bash :dir /ssh:mrrc-cerebro2:
sudo pdsh -w node[01-08] ip addr |grep -Po '(?<=inet )[0-9.]+'|grep -v ^127 |sort
#+end_src

#+RESULTS:
| 10.141.0.1 |
| 10.141.0.2 |
| 10.141.0.3 |
| 10.141.0.4 |
| 10.141.0.6 |
| 10.141.0.7 |

** Mounts
#+begin_src bash :dir /ssh:mrrc-cerebro2:
mount | awk '($1 ~ /\/dev|:/){print $1, $3}'
#+end_src

#+RESULTS:
| /dev/sda3                       | /          |
| /dev/sda3                       | /gnu/store |
| /dev/sda1                       | /boot      |
| 10.48.86.33:/raidzeus           | /raidzeus  |
| 10.141.0.8:/dataraid2/users/HCP | /disk/HCP  |


#+begin_src bash :dir /ssh:mrrc-cerebro2:
sudo pdsh -w node[01-08] mount | awk '($2 ~ /\/dev|:/){print $2, $4}'| sort |uniq -c
#+end_src

#+RESULTS:
| 6 | /dev/sda1                                      | /                       |
| 6 | /dev/sda2                                      | /var                    |
| 6 | /dev/sda3                                      | /tmp                    |
| 6 | /dev/sda6                                      | /local                  |
| 6 | 10.141.0.8:/dataraid1/nas/home/MRSI            | /home/MRSI              |
| 6 | 10.141.0.8:/dataraid1/nas/home/pkg             | /home/pkg               |
| 6 | 10.141.0.8:/dataraid2/users/HCP                | /disk/HCP               |
| 6 | 10.48.86.212:/sulcusdata1/XnatDB               | /disk/sulcus1           |
| 1 | 10.48.86.218:/aionraid                         | /aionraid               |
| 6 | 10.48.86.218:/mrraid/archive/scan_data_archive | /disk/scan_data_archive |
| 6 | 10.48.86.33:/raidzeus                          | /raidzeus               |
| 6 | 10.48.88.202:/disk/mace2                       | /disk/mace2             |
| 6 | master:/cm/shared                              | /cm/shared              |
| 6 | master:/gnu/store                              | /gnu/store              |
| 6 | master:/home                                   | /home                   |
| 6 | master:/var/guix                               | /var/guix               |
| 6 | master:/var/log/guix                           | /var/log/guix           |
